---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.TrussElementEnd1Elevation
source: html/7ba64d28-b17f-9882-bf45-944de2a2e124.htm
---
# Autodesk.Revit.DB.ParameterTypeId.TrussElementEnd1Elevation Property

"End Level Offset"

## Syntax (C#)
```csharp
public static ForgeTypeId TrussElementEnd1Elevation { get; }
```